# The MIT License (MIT)
#
# Copyright (c) 2021 NVIDIA CORPORATION
#
# Permission is hereby granted, free of charge, to any person obtaining a copy of
# this software and associated documentation files (the "Software"), to deal in
# the Software without restriction, including without limitation the rights to
# use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
# the Software, and to permit persons to whom the Software is furnished to do so,
# subject to the following conditions:
#
# The above copyright notice and this permission notice shall be included in all
# copies or substantial portions of the Software.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
# FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
# COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
# IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
# CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

name: "dali_ensemble"
platform: "ensemble"
max_batch_size: 256
input [
  {
    name: "INPUT0"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
input [
  {
    name: "INPUT1"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
output [
  {
    name: "OUTPUT1"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "dali_1"
      model_version: -1
      input_map {
        key: "INPUT_0"
        value: "INPUT0"
      }
      input_map {
        key: "INPUT_1"
        value: "INPUT1"
      }
      output_map {
        key: "OUTPUT_0"
        value: "interm_0"
      }
      output_map {
        key: "OUTPUT_1"
        value: "interm_1"
      }
    },
    {
      model_name: "dali_2"
      model_version: -1
      input_map {
        key: "INPUT_0"
        value: "interm_0"
      }
      input_map {
        key: "INPUT_1"
        value: "interm_1"
      }
      output_map {
        key: "OUTPUT_0"
        value: "OUTPUT0"
      }
      output_map {
        key: "OUTPUT_1"
        value: "OUTPUT1"
      }
    }
  ]
}
